erpdev.СХК_Расширение/src/Documents/СХК_Перемещение/СХК_Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СХК_Перемещение</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>НЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/Documents/СХК_Перемещение/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СХК_ПолныеСклад") Тогда
		
		Если РольДоступна("СХК_ПолныеСклад") И НачалоДня(Объект.Дата) <> НачалоДня(ТекущаяДата()) Тогда
			ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Истина; 
		    ЭтаФорма.Элементы.ТЧТовары.ТолькоПросмотр = Истина;
		Иначе
			ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Ложь;
			ЭтаФорма.Элементы.Автор.ТолькоПросмотр = Ложь;
		КонецЕсли;
	Иначе
    	ЭтаФорма.Элементы.ТЧТовары.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.ФормаСписатьБуфер.Видимость = Истина;	
		Элементы.Сторно.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписатьБуферНаСервере()
	Буфер = Справочники.СХК_СкладЯчейки.НайтиПоКоду("000000372");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОстатка, Ячейка = &Ячейка) КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток < 0";
	Запрос.УстановитьПараметр("ДатаОстатка",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ячейка",Буфер);
	
	Рез = Запрос.Выполнить().Выбрать();
	Объект.ТЧТовары.Очистить();
	Пока Рез.Следующий() Цикл
		Т = Объект.ТЧТовары.Добавить();
		Т.Номенклатура = Рез.Номенклатура;
		Т.Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(Рез.Серия);
		Т.ТекЯчейка = Буфер;
		Т.НЯчейка = Буфер; 
		Т.Количество = Рез.Количество;
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписатьБуфер(Команда)
	СписатьБуферНаСервере();
КонецПроцедуры
